family = {
    ('Иванов', 'Никита'): 34,
    ('Абрамова', 'Ольга'): 45,
    ('Сидоров', 'Дима'): 23,
    ('Иванов', 'Ольгерд'): 38,
    ('Петров', 'Вася'): 35,
    ('Абрамов', 'Никита'): 44,
    ('Сидорова', 'Лена'): 23,
    ('Иванов', 'Георгий'): 56,
    ('Петрова', 'Изольда'): 89,
}

surname = input('Введите фамилию: ').lower()


for i_name, i_age in family.items():
    x = i_name[0].lower()
    if surname in x:
        print(i_name[0], i_name[1], i_age)

# TODO применить рекомендации данные ранее
